load-tests/vacaciones-load.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 60
      arrivalRate: 10
      name: Warm up
    - duration: 120
      arrivalRate: 20
      name: Load test
    - duration: 60
      arrivalRate: 30
      name: Stress test
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: 'Check vacation availability'
    weight: 70
    flow:
      - post:
          url: '/api/auth/login'
          json:
            email: 'angela@notariadelpozo.com'
            password: 'password123'
          capture:
            json: '$.token'
            as: 'auth_token'
      - get:
          url: '/api/vacaciones/disponibilidad'
          qs:
            start: '2024-12-01'
            end: '2024-12-05'
          headers:
            Authorization: 'Bearer {{ auth_token }}'

  - name: 'Request vacation'
    weight: 20
    flow:
      - post:
          url: '/api/auth/login'
          json:
            email: 'olga@notariadelpozo.com'
            password: 'password123'
          capture:
            json: '$.token'
            as: 'auth_token'
      - post:
          url: '/api/vacaciones/solicitar'
          json:
            fechaInicio: '2024-12-01'
            fechaFin: '2024-12-05'
          headers:
            Authorization: 'Bearer {{ auth_token }}'

  - name: 'Get user vacations'
    weight: 10
    flow:
      - post:
          url: '/api/auth/login'
          json:
            email: 'rocio@notariacarmenvela.com'
            password: 'password123'
          capture:
            json: '$.token'
            as: 'auth_token'
      - get:
          url: '/api/vacaciones/mias'
          headers:
            Authorization: 'Bearer {{ auth_token }}'